Autodesk.Revit.DB.Structure.LoadUsageArray
An array that contains load usage objects.

Autodesk.Revit.DB.Structure.LoadUsageArray.Insert(Autodesk.Revit.DB.Structure.LoadUsage,System.Int32)
System.Int32
Insert the specified load usage into the array.
item: The load usage to be inserted into the array.
index: The load usage will be inserted before this index.
Returns: Returns whether the load usage was inserted into the array.

Autodesk.Revit.DB.Structure.LoadUsageArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.Structure.LoadUsageArray.ReverseIterator
Autodesk.Revit.DB.Structure.LoadUsageArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.Structure.LoadUsageArray.ForwardIterator
Autodesk.Revit.DB.Structure.LoadUsageArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.Structure.LoadUsageArray.Append(Autodesk.Revit.DB.Structure.LoadUsage)
void
Add the load usage to the end of the array.
item: The load usage to be added.

Autodesk.Revit.DB.Structure.LoadUsageArray.Clear
void
Removes every load usage from the array, rendering it empty.

Autodesk.Revit.DB.Structure.LoadUsageArray.Size
System.Int32
get
Returns the number of load usages that are in the array.

Autodesk.Revit.DB.Structure.LoadUsageArray.Item(System.Int32)
Autodesk.Revit.DB.Structure.LoadUsage
Gets or sets an load usage at a specified index within the array.
index: The index of the load usage to be set or retrieved.
Returns: Returns the load usage at the specified index.

Autodesk.Revit.DB.Structure.LoadUsageArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.